Table of Contents
 Class MatConcreteSIA
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material concrete SIA
[OpenModelClass("CI.StructModel.Libraries.Material.SIA.MatConcreteSIA,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatConcrete))]
public class MatConcreteSIA : MatConcrete
Inheritance
object
OpenObject
OpenElementId
Material
MatConcrete
MatConcreteSIA
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AggregateType
type of aggregate
public ConcAggregateTypeSIA AggregateType { get; set; }
Property Value
ConcAggregateTypeSIA
 CalculateDependentValues
setting calculation dependent values on fck
public bool CalculateDependentValues { get; set; }
Property Value
bool
 CementClass
type of cement class
public ConcCementClassSIA CementClass { get; set; }
Property Value
ConcCementClassSIA
 DiagramType
type of stress-strain diagram bilinear/parabolic/general for ULS calculation
public ConcDiagramType DiagramType { get; set; }
Property Value
ConcDiagramType
 Ecm
secant modulus of elasticity of concrete
public double Ecm { get; set; }
Property Value
double
 Epsc1d
compressive strain in the concrete
public double Epsc1d { get; set; }
Property Value
double
 Epsc2d
compressive strain in the concrete
public double Epsc2d { get; set; }
Property Value
double
 Fck
characteristic compressive cylinder strength of concrete at 28 days
public double Fck { get; set; }
Property Value
double
 Fcm
mean value of concrete cylinder compressive strength
public double Fcm { get; set; }
Property Value
double
 Fctk_0_05
characteristic axial tensile strength of concrete 5% quantile
public double Fctk_0_05 { get; set; }
Property Value
double
 Fctk_0_95
characteristic axial tensile strength of concrete 95% quantile
public double Fctk_0_95 { get; set; }
Property Value
double
 Fctm
mean value of axial tensile strength of concrete
public double Fctm { get; set; }
Property Value
double
 Nfc
conversion factor nfc
public double Nfc { get; set; }
Property Value
double
 PlainConcreteDiagram
Stress strain diagram with tension part
public bool PlainConcreteDiagram { get; set; }
Property Value
bool
 StoneDiameter
diameter of stone
public double StoneDiameter { get; set; }
Property Value
double
 Tck
characteristic value of the shear stress limit
public double Tck { get; set; }
Property Value
double
 Edit this page